Revit 2027 API
ConceptualConstructionType.GetWindowOrSkylightConstructionType Method
 Get a Window or Skylight ConceptualConstructionType by its ConceptualConstructionWindowSkylightType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetWindowOrSkylightConstructionType(
	Document ccda,
	ConceptualConstructionWindowSkylightType typeEnum
)
Public Shared Function GetWindowOrSkylightConstructionType (
	ccda As Document,
	typeEnum As ConceptualConstructionWindowSkylightType
) As ElementId
public:
static ElementId^ GetWindowOrSkylightConstructionType(
	Document^ ccda,
	ConceptualConstructionWindowSkylightType typeEnum
)
static member GetWindowOrSkylightConstructionType :
        ccda : Document *
        typeEnum : ConceptualConstructionWindowSkylightType -> ElementId
Parameters
ccda Document
 The Document.
typeEnum ConceptualConstructionWindowSkylightType
 The ConceptualConstructionWindowSkylightType to get the ConceptualConstructionType for.
Return Value
ElementId
 Returns ElementId of a ConceptualConstructionType.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The enum is invalid for ConceptualConstructionWindowSkylightType. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace